In [4]:
import pandas as pd
data = [[1,10,100],[2,20,200],[3,30,300]]
col = ['col1','col2','col3']
row = ['row1','row2','row3']
df = pd.DataFrame(data=data,index=row,columns=col)
print(df)

      col1  col2  col3
row1     1    10   100
row2     2    20   200
row3     3    30   300

In [8]:
result = df.sub(1)
print(result)

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [9]:
data2  = [[3],[4],[5]]
df2 = pd.DataFrame(data=data2,index=['row1','row2','row3'],columns=['col1'])
print(df2)

      col1
row1     3
row2     4
row3     5

In [10]:
result

      col1  col2  col3
row1     0     9    99
row2     1    19   199
row3     2    29   299

In [5]:
result = df.sub(df2)
print(result)

      col1  col2  col3
row1    -2   NaN   NaN
row2    -2   NaN   NaN
row3    -2   NaN   NaN

In [11]:
result = df.sub(df2, fill_value=0) #
result

      col1  col2   col3
row1    -2  10.0  100.0
row2    -2  20.0  200.0
row3    -2  30.0  300.0

In [2]:
import pandas as pd

data1 = [1,2,3,4,5]
data2 = [2,4,6,8,10]

obj1 = pd.DataFrame([1,2,3,4,5], index=['a','b','c','d','e'])

obj2 = pd.DataFrame(data=data2, index=['a','b','d','f','g'])

print(obj1)
print(obj2)

   0
a  1
b  2
c  3
d  4
e  5
    0
a   2
b   4
d   6
f   8
g  10

In [9]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame(np.arange(6).reshape(2,3),   
                       index=['2015','2016'],
                       columns = ['python','r','sql'])
df1

      python  r  sql
2015       0  1    2
2016       3  4    5

In [12]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4),
                       index=['2014','2015','2016'],
                       columns = ['python','r','sql','java'])
df2

      python  r  sql  java
2014       0  1    2     3
2015       4  5    6     7
2016       8  9   10    11

In [14]:
df1.add(df2)

      java  python     r   sql
2014   NaN     NaN   NaN   NaN
2015   NaN     4.0   6.0   8.0
2016   NaN    11.0  13.0  15.0